# a表示一个变量，=是赋予值 右边的值
# print（）在控制台打印出 type（）查看变量类型

a="xingxing"
print(type(a))
b=111
print(type(b))

# []表示list代表一个列表，可以存多个数据，多个数据中间用“，”隔开
c=[1,2,3,4]
print(type(c))

#()表示tuple代表一个元组，可以存多个数据，多个数据中间用“，”隔开
d=(1,3,5,6)
print(type(d))


# {}键值对数据  姓名:闻德月，手机号:13761085575
#{}表示dist 表示一个字典，可以存储多个键值对数据，多个数据中间用“，”隔开，key和value
w={"姓名":"闻德月","手机号":"13761085575"}
print(type(w))
print(w)


#练习
# 第一组数据   张三,李四,王五,赵六,钱七
# 第二组数据    姓名 张三  年龄 18  性别 女  科目 语文 成绩 80
# 第三组数据   A，2,3,4,5,6,7,8,9，J,Q,K
# 第四组数据  10000
# 第五组数据  学生

n=["张三","李四","王五","赵六","钱七"]
x={"姓名":"张三","年龄":"18","性别":"女","科目":"语文","成绩":80}
s=["A",2,3,4,5,6,7,8,9,"J","Q","K"]
Z=10000
r="学生"

#小明有20块钱，红双喜10块钱，玉溪25块钱，大前门5块钱   求出小明可以买那种烟
